Revit 2027 API
ParameterTypeId.StructuralSectionIshapeBoltDiameter Property
 "Bolt Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionIshapeBoltDiameter { get; }
Public Shared ReadOnly Property StructuralSectionIshapeBoltDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionIshapeBoltDiameter {
	ForgeTypeId^ get ();
}
static member StructuralSectionIshapeBoltDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace